Tekla Open API Reference for Tekla Structures 2025
CustomLineType Properties
The CustomLineType type exposes the following members.
Properties
Name | Description
Description
 The Description of the custom line type (ASCII representation of the line).
LineDescription
 The description of the custom line type. Description uses the following format: List of line segments. Positive value gives length of filled line segment and negative value gives length of empty line segment. 0 means a dot.
Name
 The Name of the custom line type.
Top
See Also
Reference
CustomLineType Class
Tekla.Structures.Drawing Namespace